{
    "HomePage": {
        "Hey": "Hey, it's Serhat, a full stack developer",
        "Desc": "I build scalable web apps from scratch, blending clean design with solid backend logic."
    },
    "NavbarItems": {
        "Home": "Home",
        "AboutMe": "About Me",
        "MyProjects": "My Projects"
    },
    "Footer": {
        "By": "by Serhat",
        "Made": "Made with"
    },
    "AboutMe": {
        "SummaryTitle": "Professional Summary",
        "Summary": "I'm a fullstack developer with a strong focus on frontend development and a passion for crafting seamless, scalable, and user-friendly web applications. With expertise in modern JavaScript libraries—especially React and Next.js—I excel at translating designs into pixel-perfect, responsive interfaces. Whether it's Figma, Zeplin, or Photoshop, I ensure every detail is accurately implemented. On the backend, I prefer working with Node.js and MongoDB, building scalable APIs and real-time applications. Lately, I've been leveraging TypeScript to improve maintainability and type safety in my projects, ensuring robust and efficient codebases. Beyond coding, I enjoy optimizing workflows, structuring clean architectures, and continuously exploring new technologies to enhance development efficiency. Let's connect and create something great together!",
        "SkillsTitle": "SKILLS",
        "SkillsDescription": "Here are some of the technologies and tools I work with on a daily basis. The percentages below represent my own experiences compared to each other.",
        "TimelineTitle": "WORK EXPERIENCE",
        "QuickInfo": {
            "Location": "Location",
            "Email": "Email",
            "Role": "Role",
            "Experience": "Experience"
        },
        "Education": {
            "Title": "Education",
            "Degree": "Bachelor of Computer Science",
            "University": "Cukurova University",
            "Description": "Studied computer science with a focus on software engineering, algorithms, and data structures."
        },
        "Experiences": {
            "Avena": "[\"Developed and maintained a MERN stack application to improve accessibility and consistency in oral health care services across the U.S.\",\"Implemented core features including appointment scheduling, user account management, reporting modules, and dynamic dashboard interfaces.\",\"Integrated medical imaging formats such as FMX, PANO, and DX into the frontend using React.js for a seamless clinical experience.\",\"Built and managed background jobs using Node.js and cron to automate tasks such as daily reporting, auto-submissions, and account cleanups.\",\"Designed and implemented a modular task management system, triggered both in real-time and via background jobs, to notify users of pending actions across various modules.\",\"Developed and optimized dynamic, filterable, and categorized data visualizations using React Chart.js 2 for dashboards, providing insightful graphical representations of complex data.\",\"Developed a roles and permissions module to control access to different parts of the application based on user roles, including the ability to manage permissions and edit roles for specific users.\",\"Created and maintained a settings page to allow admins to configure filters, job parameters, and schedules for background jobs, ensuring customizable and efficient task automation.\",\"Wrote and executed data migration scripts to support schema changes and ensure data integrity during feature updates.\",\"Worked extensively with MongoDB to handle large datasets and complex queries, optimizing performance through effective indexing and query tuning.\",\"Ensured accurate timezone handling across all U.S. regions to maintain consistency in scheduling and reporting.\"]",
            "ByNoGame": "[\"Converted Figma designs into responsive, pixel-perfect user interfaces using HTML, CSS, jQuery, and JavaScript\",\"Developed and maintained a responsive web application for the trading of in-game items and accounts across popular games such as Knight, CS:GO, Metin2, PUBG, and Valorant\",\"Implemented dynamic features and enhanced user interactivity through jQuery, ensuring a smooth user experience across multiple browsers and devices\",\"Collaborated closely with backend developers working with Laravel to integrate frontend with APIs and ensure seamless data flow between client and server\",\"Focused on optimizing frontend performance and accessibility while maintaining clean and maintainable code\",\"Ensured the site was fully responsive, providing a seamless experience on both desktop and mobile devices\",\"Implemented SEO best practices, including optimizing meta tags, image alt attributes, and URL structures to improve search engine visibility and ranking\",\"Actively contributed to the development process by submitting pull requests for code changes, collaborating with the team to ensure high-quality code\",\"Managed tasks and tracked project progress using Jira, adhering to agile methodologies and ensuring timely delivery of features and bug fixes\"]"
        },
        "Skills": {
            "FrontendDevelopment": {
                "Title": "Frontend Development",
                "Description": "Creating responsive, accessible, and performant user interfaces with modern frameworks and libraries."
            },
            "BackendDevelopment": {
                "Title": "Backend Development",
                "Description": "Building robust and scalable server-side applications, APIs, and services that power dynamic web applications, handle complex business logic, and ensure high performance, security, and maintainability."
            },
            "DatabaseManagement": {
                "Title": "Database Management",
                "Description": "Designing and implementing efficient database solutions for various application needs."
            },
            "WebPerformance": {
                "Title": "Web Performance",
                "Description": "Optimizing websites for speed, accessibility, and search engine visibility."
            },
            "MobileDevelopment": {
                "Title": "Mobile Development",
                "Description": "Creating cross-platform mobile applications with responsive design principles."
            },
            "DevelopmentTools": {
                "Title": "Development Tools",
                "Description": "Utilizing modern development tools and practices for efficient workflow and collaboration."
            }
        }
    },
    "MyProject": {
        "Title": "Page Under Construction",
        "Summary": "This page is currently being updated.\nRelevant content will be available here shortly.\nThank you for your understanding."
    },
    "ContactMe": {
        "Title": "Contact Me",
        "Desc": "I would be happy to assist you with anything you need. Feel free to reach out to me anytime!",
        "AddressTitle": "Address",
        "EmailTitle": "Email",
        "PhoneTitle": "Phone",
        "FormTitle": "Send Message",
        "NameLabel": "Full Name",
        "EmailLabel": "Email",
        "TextareaLabel": "Message",
        "ButtonText": "Send",
        "SuccessMessage": "Your message has been sent successfully!"
    },
    "MyProjects": {
        "Title": "My Projects",
        "Subtitle": "Here's a collection of my recent work.",
        "All": "All Projects",
        "Featured": "Featured",
        "Frontend": "Frontend",
        "Fullstack": "Full Stack",
        "Category": {
            "frontend": "Frontend",
            "fullstack": "Full Stack",
            "other": "Other"
        },
        "FeaturedBadge": "Featured",
        "ViewDetails": "View Details",
        "MoreOnGithub": "More on GitHub",
        "Dialog": {
            "Technologies": "Technologies Used",
            "Objectives": "Objectives",
            "Solutions": "Solutions",
            "ViewCode": "View Code",
            "LiveDemo": "Live Demo"
        },
        "Projects": {
            "project1": {
                "title": "Pencil Club",
                "Description": "Full-featured blog platform built with React, NestJS, and MongoDB.",
                "longDescription": "Pencil Club is a comprehensive blog platform developed with ReactJS frontend and NestJS backend. It provides secure user authentication based on JWT, email confirmation, and Google OAuth integration. Users can create and edit profiles, visit other users' profile pages, comment on blog posts, reply, and manage likes. Filtering by categories and advanced search make content easily accessible. All media files are securely stored on AWS S3.",
                "challenges": "[\"Develop a secure and scalable user authentication and authorization system based on JWT.\",\"Ensure reliable user registration with email verification and Google OAuth integration.\",\"Synchronize profile management and viewing other users' profiles.\",\"Make comment, reply, and like systems for blog posts realistic and user-friendly.\",\"Implement post filtering by category and strong search engine optimization.\",\"Create secure, fast, and scalable file upload processes on AWS S3.\"]",
                "solutions": "[\"Implemented secure authentication and authorization mechanisms with JWT, and applied a refresh token system.\",\"Automated email verification with NodeMailer and added social login support with Google OAuth.\",\"Optimized profile operations and access with React state management and API optimization.\",\"Developed optimized data models and API endpoints for comments, replies, and likes in the backend.\",\"Used MongoDB text indexes and appropriate query techniques for category filtering and search engine.\",\"Files are uploaded to AWS S3 with Multer; S3 SDK is used for high performance and security.\"]"
            },
            "project2": {
                "title": "Plant Healthy",
                "Description": "A React + NestJS app that tracks plant health and provides weather and care suggestions.",
                "longDescription": "Plant Healthy is a comprehensive application focused on plant health, developed with ReactJS frontend and NestJS backend. Users can securely log in with Google OAuth and email verification. Plant lists and details can be viewed, and regional weather data is fetched from the Open-Meteo API to provide watering and care suggestions. Users can also select locations on a map to more accurately track the weather for their plants. With a user-friendly interface, plant health is always under control.",
                "challenges": "[\"Provide secure user authentication with Google OAuth and email verification.\",\"Accurately fetch real-time and regional weather data using the Open-Meteo API.\",\"Integrate location selection via map and synchronize data with the backend.\",\"Synchronize and optimize complex state management with Redux.\",\"Enable fast queries on large datasets with MongoDB optimizations.\",\"Deliver an aesthetic and usable interface on all devices with responsive design.\"]",
                "solutions": "[\"Implemented JWT-based security and automated email verification with NodeMailer, integrated Google OAuth.\",\"Provided accurate and up-to-date weather data using the Open-Meteo API.\",\"Integrated interactive maps with Leaflet and React-Leaflet.\",\"Synchronized user-selected location data with the backend for personalized care suggestions.\",\"Achieved effective state management and performance improvements with React and Redux.\",\"Optimized indexing and queries in MongoDB.\",\"Designed a responsive and modern UI using CSS Grid and Flexbox.\"]"
            },
            "project3": {
                "title": "Movie App",
                "Description": "A discovery app built with React, Redux, and TypeScript, filtering movies and series by year and genre using OMDb API.",
                "longDescription": "Movie App is a movie/series discovery platform integrated with the OMDb API, built with React and Redux for performance and TypeScript for robustness. Features include filtering by year and genre, detail pages, and series episodes. Framer Motion is used for page transitions and component animations, providing a top-notch user experience. It's a modern app that appeals to both aesthetics and performance.",
                "challenges": "[\"Fetch up-to-date and accurate movie/series data from the OMDb API.\",\"Create an effective filtering system by year and genre.\",\"Display series episodes and details for each episode.\",\"Manage global state with Redux.\",\"Integrate page transitions and component animations with Framer Motion.\",\"Design a responsive and user-friendly interface.\"]",
                "solutions": "[\"Managed data fetching from OMDb API using Axios.\",\"Optimized filtering operations with Redux.\",\"Implemented dynamic page transitions and episode details with React Router.\",\"Provided smooth animations and transitions using Framer Motion.\",\"Managed styles with CSS Modules and developed a responsive design.\"]"
            },
            "project4": {
                "title": "Love App",
                "Description": "A full-featured love app built with React, Redux, Express, and MongoDB.",
                "longDescription": "to be updated",
                "challenges": "[\"to be updated\"]",
                "solutions": "[\"to be updated\"]"
            },
            "project5": {
                "title": "Sinem Odalı Belen – Portfolio",
                "Description": "Next.js and Tailwind CSS built, SEO friendly and mobile friendly corporate website.",
                "longDescription": "The corporate website prepared for Sinem Odalı Belen, developed with modern technologies. The site built with Next.js App Router and TypeScript; it stands out with personal introduction, service areas, career history, and contact sections. It is equipped with SEO-friendly components such as Google Search Console integration, dynamic metadata management, sitemap, and robots.txt. Additionally, it supports Open Graph and JSON-LD, optimizing social media visibility.",
                "challenges": "[\"Develop a clean and effective user interface for a corporate structure.\",\"Implement Google Search Console validation and indexing.\",\"Create a mobile-friendly, fast-loading, and accessible site.\",\"Support Open Graph and JSON-LD for SEO and social media visibility.\",\"Manage domain and fast CI/CD integration on Vercel.\"]",
                "solutions": "[\"Developed a responsive and modern UI with Next.js App Router and Tailwind CSS.\",\"Implemented Google Search Console validation and custom metadata.\",\"Automated sitemap and robots.txt generation with next-sitemap.\",\"Enhanced SEO and social media visibility with Open Graph and JSON-LD.\",\"Managed domain and fast CI/CD integration on Vercel.\"]"
            }
        }
    }
}
