{
    "HomePage": {
        "Hey": "Hey, it's Serhat, a full stack developer",
        "Desc": "I build scalable web apps from scratch, blending clean design with solid backend logic."
    },
    "NavbarItems": {
        "Home": "Home",
        "AboutMe": "About Me",
        "MyProjects": "My Projects"
    },
    "Footer": {
        "By": "by Serhat",
        "Made": "Made with"
    },
    "AboutMe": {
        "SummaryTitle": "Professional Summary",
        "Summary": "I'm a fullstack developer with a strong focus on frontend development and a passion for crafting seamless, scalable, and user-friendly web applications. With expertise in modern JavaScript libraries—especially React and Next.js—I excel at translating designs into pixel-perfect, responsive interfaces. Whether it's Figma, Zeplin, or Photoshop, I ensure every detail is accurately implemented. On the backend, I prefer working with Node.js and MongoDB, building scalable APIs and real-time applications. Lately, I've been leveraging TypeScript to improve maintainability and type safety in my projects, ensuring robust and efficient codebases. Beyond coding, I enjoy optimizing workflows, structuring clean architectures, and continuously exploring new technologies to enhance development efficiency. Let's connect and create something great together!",
        "SkillsTitle": "SKILLS",
        "SkillsDescription": "Here are some of the technologies and tools I work with on a daily basis.",
        "TimelineTitle": "WORK EXPERIENCE",
        "QuickInfo": {
            "Location": "Location",
            "Email": "Email",
            "Role": "Role",
            "Experience": "Experience"
        },
        "Education": {
            "Title": "Education",
            "Degree": "Bachelor of Computer Science",
            "University": "University of Technology",
            "Description": "Studied computer science with a focus on software engineering, algorithms, and data structures. Participated in various coding competitions and hackathons."
        },
        "Experiences": {
            "Avena": "[\"Developed and maintained a MERN stack application to improve accessibility and consistency in oral health care services across the U.S.\",\"Implemented core features including appointment scheduling, user account management, reporting modules, and dynamic dashboard interfaces.\",\"Integrated medical imaging formats such as FMX, PANO, and DX into the frontend using React.js for a seamless clinical experience.\",\"Built and managed background jobs using Node.js and cron to automate tasks such as daily reporting, auto-submissions, and account cleanups.\",\"Designed and implemented a modular task management system, triggered both in real-time and via background jobs, to notify users of pending actions across various modules.\",\"Developed and optimized dynamic, filterable, and categorized data visualizations using React Chart.js 2 for dashboards, providing insightful graphical representations of complex data.\",\"Developed a roles and permissions module to control access to different parts of the application based on user roles, including the ability to manage permissions and edit roles for specific users.\",\"Created and maintained a settings page to allow admins to configure filters, job parameters, and schedules for background jobs, ensuring customizable and efficient task automation.\",\"Wrote and executed data migration scripts to support schema changes and ensure data integrity during feature updates.\",\"Worked extensively with MongoDB to handle large datasets and complex queries, optimizing performance through effective indexing and query tuning.\",\"Ensured accurate timezone handling across all U.S. regions to maintain consistency in scheduling and reporting.\"]",
            "ByNoGame": "[\"Converted Figma designs into responsive, pixel-perfect user interfaces using HTML, CSS, jQuery, and JavaScript\",\"Developed and maintained a responsive web application for the trading of in-game items and accounts across popular games such as Knight, CS:GO, Metin2, PUBG, and Valorant\",\"Implemented dynamic features and enhanced user interactivity through jQuery, ensuring a smooth user experience across multiple browsers and devices\",\"Collaborated closely with backend developers working with Laravel to integrate frontend with APIs and ensure seamless data flow between client and server\",\"Focused on optimizing frontend performance and accessibility while maintaining clean and maintainable code\",\"Ensured the site was fully responsive, providing a seamless experience on both desktop and mobile devices\",\"Implemented SEO best practices, including optimizing meta tags, image alt attributes, and URL structures to improve search engine visibility and ranking\",\"Actively contributed to the development process by submitting pull requests for code changes, collaborating with the team to ensure high-quality code\",\"Managed tasks and tracked project progress using Jira, adhering to agile methodologies and ensuring timely delivery of features and bug fixes\"]"
        },
        "Skills": {
            "FrontendDevelopment": {
                "Title": "Frontend Development",
                "Description": "Creating responsive, accessible, and performant user interfaces with modern frameworks and libraries."
            },
            "BackendDevelopment": {
                "Title": "Backend Development",
                "Description": "Building robust and scalable server-side applications, APIs, and services that power dynamic web applications, handle complex business logic, and ensure high performance, security, and maintainability."
            },
            "DatabaseManagement": {
                "Title": "Database Management",
                "Description": "Designing and implementing efficient database solutions for various application needs."
            },
            "WebPerformance": {
                "Title": "Web Performance",
                "Description": "Optimizing websites for speed, accessibility, and search engine visibility."
            },
            "MobileDevelopment": {
                "Title": "Mobile Development",
                "Description": "Creating cross-platform mobile applications with responsive design principles."
            },
            "DevelopmentTools": {
                "Title": "Development Tools",
                "Description": "Utilizing modern development tools and practices for efficient workflow and collaboration."
            }
        }
    },
    "MyProject": {
        "Title": "Page Under Construction",
        "Summary": "This page is currently being updated.\nRelevant content will be available here shortly.\nThank you for your understanding."
    },
    "ContactMe": {
        "Title": "Contact Me",
        "Desc": "I would be happy to assist you with anything you need. Feel free to reach out to me anytime!",
        "AddressTitle": "Address",
        "EmailTitle": "Email",
        "PhoneTitle": "Phone",
        "FormTitle": "Send Message",
        "NameLabel": "Full Name",
        "EmailLabel": "Email",
        "TextareaLabel": "Message",
        "ButtonText": "Send",
        "SuccessMessage": "Your message has been sent successfully!"
    }
}
