{
    "HomePage": {
        "Hey": "Selam, ben Serhat, full stack developer'ım",
        "Desc": "Temiz tasarımı sağlam arka uç mantığıyla harmanlayarak sıfırdan ölçeklenebilir web uygulamaları oluşturuyorum."
    },
    "NavbarItems": {
        "Home": "Anasayfa",
        "AboutMe": "Hakkımda",
        "MyProjects": "Projelerim"
    },
    "Footer": {
        "By": "ile yapıldı",
        "Made": "Serhat tarafından"
    },
    "AboutMe": {
        "SummaryTitle": "Özet",
        "Summary": "Front-end geliştirmeye güçlü bir şekilde odaklanan ve kusursuz, ölçeklenebilir ve kullanıcı dostu web uygulamaları oluşturma tutkusuna sahip full-stack bir geliştiriciyim. Modern JavaScript kütüphanelerinde sahip olduğum tecrübe ile (özellikle React ve Next.js) tasarımları piksel mükemmelliğinde, responsive arayüzlere dönüştürme yetkinliğine sahibim. Figma, Zeplin veya Photoshop olsun, her ayrıntının doğru bir şekilde uygulanmasını sağlarım. Arka uçta, ölçeklenebilir API'ler ve gerçek zamanlı uygulamalar oluşturarak Node.js ve MongoDB ile çalışmayı tercih ediyorum. Projelerimde sürdürülebilirliği ve tür güvenliğini iyileştirmek için TypeScript'i kullanıyorum ve sağlam ve verimli kod tabanları sağlıyorum. Kodlamanın ötesinde, iş akışlarını optimize etmekten, temiz mimariler yapılandırmaktan ve geliştirme verimliliğini artırmak için sürekli olarak yeni teknolojileri keşfetmekten hoşlanıyorum. Bağlantı kuralım ve birlikte harika işler çıkartalım!",
        "SkillsTitle": "YETENEKLER",
        "SkillsDescription": "Günlük olarak çalıştığım teknolojiler ve araçlardan bazıları... Aşağıdaki yüzdeler, kendi tecrübelerimin birbirleriyle kıyaslamalarını temsil etmektedir.",
        "TimelineTitle": "İŞ DENEYİMİ",
        "QuickInfo": {
            "Location": "Konum",
            "Email": "E-posta",
            "Role": "Rol",
            "Experience": "Deneyim"
        },
        "Education": {
            "Title": "Eğitim",
            "Degree": "Bilgisayar Mühendisliği Lisans",
            "University": "Çukurova Üniversitesi",
            "Description": "Yazılım mühendisliği, algoritmalar ve veri yapılarına odaklanarak bilgisayar bilimleri eğitimi aldım."
        },
        "Experiences": {
            "Avena": "[\"ABD genelinde ağız sağlığı bakım hizmetlerinde erişilebilirliği ve tutarlılığı artırmak için bir MERN yığın uygulaması geliştirildi ve sürdürüldü.\",\"Randevu planlama, kullanıcı hesabı yönetimi, raporlama modülleri ve dinamik analitik pano arayüzleri gibi temel özellikler uygulandı.\",\"Kusursuz bir klinik deneyim için FMX, PANO ve DX gibi tıbbi görüntüleme formatlarını React.js kullanarak ön yüze entegre ettik.\",\"- Günlük raporlama, otomatik gönderimler ve hesap temizlemeleri gibi görevleri otomatikleştirmek için Node.js ve cron kullanarak arka plan işleri oluşturuldu ve yönetildi.\",\"Hem gerçek zamanlı olarak hem de arka plandaki işler aracılığıyla tetiklenen, kullanıcıları çeşitli modüllerdeki bekleyen eylemler konusunda bilgilendirmek için modüler bir görev yönetim sistemi tasarlandı ve uygulandı.\",\"Karmaşık verilerin içgörülü grafiksel gösterimlerini sağlamak için gösterge panelleri için React Chart.js 2'yi kullanarak dinamik, filtrelenebilir ve kategorize edilmiş veri görselleştirmeleri geliştirdim ve optimize ettim.\",\"Kullanıcı rollerine göre uygulamanın farklı bölümlerine erişimi kontrol etmek için roller ve izinler modülü geliştirildi. Ayrıca belirli kullanıcılar için izinleri yönetme ve rolleri düzenleme yeteneği eklendi.\",\"Yöneticilerin arka plan işleri için filtreleri, iş parametrelerini ve zamanlamaları yapılandırmasına olanak tanıyan bir ayarlar sayfası oluşturuldu ve sürdürüldü; böylece özelleştirilebilir ve etkili görev otomasyonu sağlandı.\",\"Özellik güncellemeleri sırasında şema değişikliklerini desteklemek ve veri bütünlüğünü sağlamak için veri taşıma komut dosyaları yazdı ve yürüttü.\",\"Büyük veri kümelerini ve karmaşık sorguları yönetmek için MongoDB ile kapsamlı bir şekilde çalıştım, etkili dizinleme ve sorgu ayarlaması yoluyla performansı optimize ettim.\",\"Planlama ve raporlamada tutarlılığı sağlamak için ABD'nin tüm bölgelerinde doğru zaman dilimi yönetimi sağlandı.\"]",
            "ByNoGame": "[\"HTML, CSS, jQuery ve JavaScript kullanarak Figma tasarımlarını duyarlı, piksel mükemmelliğinde kullanıcı arayüzlerine dönüştürüldü.\",\"Knight, CS:GO, Metin2, PUBG ve Valorant gibi popüler oyunlar arasında oyun içi öğelerin ve hesapların ticareti için duyarlı bir web uygulamasında front-end developer olarak görev yapıldı.\",\"jQuery aracılığıyla dinamik özellikler uygulandı ve kullanıcı etkileşimi geliştirildi, böylece birden fazla tarayıcı ve cihazda sorunsuz bir kullanıcı deneyimi sağlandı\",\"Laravel ile çalışan arka uç geliştiricilerle yakın bir şekilde işbirliği yapılarak front-end API'lerle entegre edildi ve istemci ile sunucu arasında sorunsuz veri akışı sağlandı\",\"Temiz ve sürdürülebilir kod korunurken, ön uç performansı ve erişilebilirliği optimize etmeye odaklanıldı\",\"Sitenin tam olarak duyarlı olmasını sağlandı. Hem masaüstü hem de mobil cihazlarda sorunsuz bir deneyim sunuldu\",\"Arama motoru görünürlüğünü ve sıralamasını iyileştirmek için SEO best practice'leri uygulandı\",\"Kod değişiklikleri için pull-requestler göndererek, yüksek kaliteli kod sağlamak için ekiple iş birliği yaparak geliştirme sürecine aktif olarak katkıda bulunuldu\",\"Jira'yı kullanarak görevler yönetildi, agile metodolojilere uyarak yeni özelliklerin ve hata düzeltmelerinin zamanında teslim edilmesi sağlandı\"]"
        },
        "Skills": {
            "FrontendDevelopment": {
                "Title": "Frontend Geliştirme",
                "Description": "Modern framework ve kütüphanelerle duyarlı, erişilebilir ve performanslı kullanıcı arayüzleri oluşturma."
            },
            "BackendDevelopment": {
                "Title": "Backend Geliştirme",
                "Description": "Dinamik web uygulamalarını destekleyen, karmaşık iş mantığını ele alan ve yüksek performans, güvenlik ve sürdürülebilirlik sağlayan sağlam ve ölçeklenebilir sunucu taraflı uygulamalar, API'ler ve hizmetler oluşturma."
            },
            "DatabaseManagement": {
                "Title": "Veritabanı Yönetimi",
                "Description": "Çeşitli uygulama ihtiyaçları için verimli veritabanı çözümleri tasarlama ve uygulama."
            },
            "WebPerformance": {
                "Title": "Web Performansı",
                "Description": "Web sitelerini hız, erişilebilirlik ve arama motoru görünürlüğü için optimize etme."
            },
            "MobileDevelopment": {
                "Title": "Mobil Geliştirme",
                "Description": "Duyarlı tasarım prensipleriyle çapraz platform mobil uygulamalar oluşturma."
            },
            "DevelopmentTools": {
                "Title": "Geliştirme Araçları",
                "Description": "Verimli iş akışı ve işbirliği için modern geliştirme araçlarını ve uygulamalarını kullanma."
            }
        }
    },
    "MyProject": {
        "Title": "Sayfa Yapım Aşamasında",
        "Summary": "Bu sayfa şu anda güncellenme sürecinde.\nKısa süre içinde ilgili içerikleri buradan erişilebilir hale getireceğim.\nAnlayışınız için teşekkür ederim."
    },
    "ContactMe": {
        "Title": "Bana Ulaşın",
        "Desc": "İhtiyacınız olan her konuda yardımcı olmaktan mutluluk duyarız. Bize her zaman ulaşabilirsiniz!",
        "AddressTitle": "Adres",
        "EmailTitle": "Email",
        "PhoneTitle": "Telefon",
        "FormTitle": "Mesaj Gönder",
        "NameLabel": "İsim",
        "EmailLabel": "Email",
        "TextareaLabel": "Mesaj",
        "ButtonText": "Gönder",
        "SuccessMessage": "Mesajınız başarıyla gönderildi!"
    },
    "MyProjects": {
        "Title": "Projelerim",
        "Subtitle": "Son çalışmalarımın bir koleksiyonu.",
        "All": "Tüm Projeler",
        "Featured": "Öne Çıkanlar",
        "Frontend": "Frontend",
        "Fullstack": "Full Stack",
        "Category": {
            "frontend": "Frontend",
            "fullstack": "Full Stack",
            "other": "Diğer"
        },
        "FeaturedBadge": "Öne Çıkan",
        "ViewDetails": "Detayları Gör",
        "MoreOnGithub": "GitHub'da Daha Fazlası",
        "Dialog": {
            "Technologies": "Kullanılan Teknolojiler",
            "Objectives": "Hedefler",
            "Solutions": "Çözümler",
            "ViewCode": "Kodu Görüntüle",
            "LiveDemo": "Canlı Demo"
        },
        "Projects": {
            "project1": {
                "title": "Kalem Kulübü",
                "Description": "React, NestJS ve MongoDB ile oluşturulmuş tam özellikli blog platformu.",
                "longDescription": "Kalem Kulübü, ReactJS frontend ve NestJS backend ile geliştirilmiş kapsamlı bir blog platformudur. JWT tabanlı güvenli kullanıcı doğrulama, e-posta onayı ve Google OAuth entegrasyonu sağlar. Kullanıcılar profil oluşturabilir, profilleri düzenleyebilir ve başkalarının profil sayfalarını ziyaret edebilir. Blog gönderilerine yorum yapabilir, yanıtlayabilir, beğenip beğenmemeyi yönetebilir. Kategorilere göre filtreleme yapabilir ve gelişmiş arama motoru ile içeriklere kolayca erişebilir. Tüm medya dosyaları AWS S3 üzerinde güvenle saklanır.",
                "challenges": "[\"JWT tabanlı güvenli ve ölçeklenebilir kullanıcı doğrulama ve yetkilendirme sistemi geliştirmek.\",\"E-posta doğrulama ve Google OAuth entegrasyonu ile güvenilir kullanıcı kaydı sağlamak.\",\"Profil yönetimi ve başkalarının profillerini görüntüleme özelliklerini senkronize etmek.\",\"Blog gönderileri için yorum, yanıt ve beğeni sistemlerini gerçekçi ve kullanıcı dostu kılmak.\",\"Kategorilere göre post filtreleme ve güçlü arama motoru optimizasyonu yapmak.\",\"AWS S3 üzerinde güvenli, hızlı ve ölçeklenebilir dosya yükleme süreçleri oluşturmak.\"]",
                "solutions": "[\"JWT ile güvenli kimlik doğrulama ve yetkilendirme mekanizmaları oluşturuldu, refresh token sistemi uygulandı.\",\"NodeMailer ile e-posta doğrulama süreçleri otomatize edildi, Google OAuth ile sosyal giriş desteği eklendi.\",\"React state yönetimi ve API optimizasyonu ile profil işlemleri ve erişimleri efektif hale getirildi.\",\"Yorum, yanıt ve beğeni işlemleri için backend'de optimize edilmiş veri modelleri ve API endpointleri geliştirildi.\",\"Kategori filtreleme ve arama motoru için MongoDB text indeksleri ve uygun sorgu teknikleri kullanıldı.\",\"Multer ile dosyalar AWS S3'e yükleniyor; yüksek performans ve güvenlik için S3 SDK kullanıldı.\"]"
            },
            "project2": {
                "title": "Plant Healthy",
                "Description": "Bitki sağlığını takip eden, hava durumu ve bakım önerileri sunan React + NestJS uygulaması.",
                "longDescription": "Plant Healthy, ReactJS frontend ve NestJS backend ile geliştirilmiş, bitki sağlığına odaklanan kapsamlı bir uygulamadır. Kullanıcılar Google OAuth ve e-posta doğrulama ile güvenle giriş yapabilir. Bitki listesi ve detayları görüntülenebilir, bölgesel hava durumu verileri Open-Meteo API'den çekilerek sulama ve bakım önerileri sunulur. Ayrıca kullanıcılar harita üzerinden konum seçerek bitkilerinin bulunduğu alanın hava durumunu daha doğru takip edebilir. Kullanıcı dostu arayüz ile bitkilerin sağlığı her zaman kontrol altındadır.",
                "challenges": "[\"Google OAuth ve e-posta doğrulama ile güvenli kullanıcı kimlik doğrulaması sağlamak.\",\"Open-Meteo API ile gerçek zamanlı ve bölgesel hava durumu verilerini doğru şekilde almak.\",\"Harita üzerinden kullanıcıların lokasyon seçimini entegre etmek ve veriyi backend ile senkronize etmek.\",\"Karmaşık state yönetimini Redux ile senkronize ve performanslı hale getirmek.\",\"MongoDB optimizasyonları ile büyük veri setlerinde hızlı sorgulama yapmak.\",\"Responsive tasarım ile tüm cihazlarda estetik ve kullanılabilir arayüz sunmak.\"]",
                "solutions": "[\"JWT tabanlı güvenlik ve NodeMailer ile e-posta doğrulama süreçleri uygulandı, Google OAuth entegre edildi.\",\"Open-Meteo API kullanılarak doğru ve güncel hava durumu verileri sunuldu.\",\"Leaflet ve React-Leaflet kütüphaneleri ile interaktif harita entegrasyonu gerçekleştirildi.\",\"Kullanıcıların seçtiği lokasyon bilgisi backend ile senkronize edilerek kişiselleştirilmiş bakım önerileri sağlandı.\",\"React ve Redux ile etkili state yönetimi sağlandı, performans iyileştirildi.\",\"MongoDB'de indeksleme ve sorgu optimizasyonları yapıldı.\",\"CSS Grid ve Flexbox kullanılarak responsive ve modern UI tasarlandı.\"]"
            },
            "project3": {
                "title": "Movie App",
                "Description": "React + Redux + TypeScript ile yapılmış, OMDb API kullanarak film ve dizileri yıla, türe göre filtreleyen, detaylı ve animasyonlu keşif uygulaması.",
                "longDescription": "Movie App, OMDb API ile entegre, React ve Redux ile performanslı, TypeScript ile sağlam yapıda bir film/dizi keşif platformu. Yıl ve türe göre filtreleme, detay sayfaları ve dizi bölümleri özelliklerine ek olarak, Framer Motion kullanılarak sayfa geçişleri ve component animasyonlarıyla kullanıcı deneyimi doruklarda. Hem göze hem performansa hitap eden modern bir uygulama.",
                "challenges": "[\"OMDb API'den güncel ve doğru film/dizi verilerini çekmek.\",\"Yıl ve türe göre etkin filtreleme sistemi oluşturmak.\",\"Dizi bölümlerini ve her bölümün detaylarını göstermek.\",\"Redux ile global state yönetimini sağlamak.\",\"Framer Motion ile sayfa geçişleri ve component animasyonlarını entegre etmek.\",\"Responsive ve kullanıcı dostu arayüz tasarlamak.\"]",
                "solutions": "[\"Axios ile OMDb API çağrıları yapıldı ve veri yönetimi sağlandı.\",\"Redux kullanılarak filtreleme işlemleri optimize edildi.\",\"React Router ile dinamik sayfa geçişleri ve bölüm detayları uygulandı.\",\"Framer Motion kullanılarak pürüzsüz animasyonlar ve geçişler sağlandı.\",\"CSS Modules ile stil yönetimi yapıldı, responsive tasarım geliştirildi.\"]"
            },
            "project4": {
                "title": "Aşk Uygulaması",
                "Description": "React, Redux, Express ve MongoDB ile tam özellikli bir aşk uygulaması.",
                "longDescription": "güncellenecek",
                "challenges": "[\"güncellenecek\"]",
                "solutions": "[\"güncellenecek\"]"
            }
        }
    }
}
